# coding:utf_8
import random

# 子どもの名前ランキングから抜粋
FIRST_NAMES = (
    '蒼', '陽葵', '樹', '凛', '蓮', '詩', '陽翔', '結菜', '律', '結愛', '朝陽', '莉子', '湊', '結月', '新', '紬', '大和', '澪', '大翔', '結衣', '暖', '葵', '悠真', '咲良', '颯真', '陽菜', '湊斗', '芽依', '陽斗', '凪', '颯太', '美桜', '伊織', '愛', '悠人', '花', '結翔', '朱莉', '碧', '心春', '陽向', '美月', '陸', 'さくら', '結斗', '杏', '凪', '芽生', '悠斗', '楓', '陽太', '杏奈', '葵', '蘭', '絢斗', '和花', '朔', 'ひかり', '奏太', '琴音', '颯', '琴葉', '旭', '彩葉', '岳', 'あかり', '陽', '咲希', '陽大', '心咲', '碧人', '栞奈', '湊大', '紗菜', '悠', '陽菜乃', '颯斗', '愛菜', '一颯', '結', '瑛斗', '光莉', '碧斗', '七海', '陸斗', '心結', '櫂', '柚希', '瑛翔', '柚葉', '奏汰', '凜', '蒼空', 'すず', '蒼太', 'はな', '悠翔', '一華', '遥斗', '心音', '怜', '陽咲', '瑛太', '莉央', '健人', '菫', '晴', 'ひまり', '壮真', '一花', '太陽', '花音', '大晴', '華', '大智', '心陽', '湊介', '綾乃', '翼', '光', '琉生', '咲', '海斗', '千愛', '海翔', '美海', '空', '美結', '光希', '百花', '仁', '風花', '蒼士', '明莉', '蒼大', '優月', '慧', '莉緒', '晴翔', 'いろは', '煌', 'すみれ', '煌大', '愛莉', '啓太', '桜', '慶', '実桜', '健斗', '紗奈', '光', '紗良', '航', '晴', '晴大', '乃愛', '奏多', '美緒', '大誠', '文乃', '湊翔', '未来', '優', '柚月', '悠生', '和', '翔', '栞', '颯人', '莉愛', '綾人', '依茉', '結人', '芽衣', '匠海', '結香', '新太', '彩心', '迅', '咲来', '蒼生', '咲茉', '大知', '詩織', '悠仁', '心', '理仁', '千晴', '涼太', '紬葵', '颯汰', '紬希', '一翔', '美羽', '桔平', '美波', '圭', '美優', '健', '柚乃', '潤', '玲奈', '匠', '和奏', '丈', '晴斗', '奏', '奏斗', '蒼人', '蒼翔', '尊', '湊士', '悠希', '悠誠', '諒真', '和真', '翔太'
)
# 苗字の人口ランキング Top 300 から抜粋
LAST_NAMES = (
    '佐藤', '鈴木', '高橋', '田中', '伊藤', '渡辺', '山本', '中村', '小林', '加藤', '吉田', '山田', '佐々木', '山口', '松本', '井上', '木村', '林', '斎藤', '清水', '山崎', '森', '池田', '橋本', '阿部', '石川', '山下', '中島', '石井', '小川', '前田', '岡田', '長谷川', '藤田', '後藤', '近藤', '村上', '遠藤', '青木', '坂本', '斉藤', '福田', '太田', '西村', '藤井', '金子', '岡本', '藤原', '三浦', '中野', '中川', '原田', '松田', '竹内', '小野', '田村', '中山', '和田', '石田', '森田', '上田', '原', '内田', '柴田', '酒井', '宮崎', '横山', '高木', '安藤', '宮本', '大野', '小島', '谷口', '工藤', '今井', '高田', '増田', '丸山', '杉山', '村田', '大塚', '新井', '小山', '平野', '藤本', '河野', '上野', '野口', '武田', '松井', '千葉', '菅原', '岩崎', '木下', '久保', '佐野', '野村', '松尾', '菊地', '市川', '杉本', '古川', '大西', '島田', '水野', '桜井', '高野', '渡部', '吉川', '山内', '西田', '飯田', '菊池', '西川', '小松', '北村', '安田', '五十嵐', '川口', '平田', '関', '中田', '久保田', '服部', '東', '岩田', '土屋', '川崎', '福島', '本田', '辻', '樋口', '秋山', '田口', '永井', '山中', '中西', '吉村', '川上', '石原', '大橋', '松岡', '浜田', '馬場', '森本', '矢野', '星野', '浅野', '松下', '大久保', '吉岡', '小池', '野田', '荒木', '大谷', '松浦', '内藤', '熊谷', '黒田', '尾崎', '川村', '永田', '望月', '田辺', '松村', '堀', '荒井', '大島', '平井', '早川', '菅野', '栗原', '西山', '広瀬', '横田', '石橋', '萩原', '岩本', '片山', '関口', '宮田', '大石', '高山', '本間', '須藤', '吉野', '岡崎', '小田', '伊東', '鎌田', '上原', '篠原', '小西', '松原', '福井', '古賀', '大森', '成田', '小泉', '南', '奥村', '内山', '沢田', '桑原', '三宅', '川島', '片岡', '富田', '杉浦', '岡', '八木', '奥田', '小沢', '松永', '北川', '関根', '河合', '平山', '牧野', '白石', '今村', '寺田', '青山', '中尾', '小倉', '渋谷', '上村', '小野寺', '大山', '足立', '岡村', '坂口', '天野', '多田', '佐久間', '根本', '豊田', '田島', '飯塚', '村山', '角田', '武藤', '西', '白井', '竹田', '宮下', '塚本', '榎本', '坂田', '神谷', '児玉', '水谷', '坂井', '齋藤', '小原', '浅井', '岡部', '小笠原', '森下', '神田', '中井', '植田', '河村', '宮川', '稲垣', '前川', '大川', '松崎', '長田', '若林', '飯島', '谷', '大沢', '石塚', '安部', '堀内', '及川', '田代', '中嶋', '江口', '山根', '中谷', '岸本', '荒川', '本多', '西尾', '森山', '岡野', '細川', '金井', '今野', '戸田', '稲葉', '安達', '津田', '森川', '落合', '土井', '村松', '星'
)
BOOK_NAME_FIRST = (
    '考える', '健康', '睡眠', '運動', '独学', 'エッセンシャル', '学習', '営業', 'アート', '仮説', 'マネジメント', 'アウトプット', 'コンサル', 'デザイン', 'ロジカル', 'クリエイティブ', '雑談', 'コーチング', 'ジョブ'
)
BOOK_NAME_SECOND = (
    '仕事術', '時間術', '交渉術', '読書術', '力', 'が9割', '筋トレ', '大全', '習慣', '思考', '組織', '図鑑', '入門', '実践', '一年目が学ぶこと', 'シンキング', 'をしなさい', 'をやめなさい', 'の科学', '理論'
)

def random_author_name():
    return random.choice(LAST_NAMES) + random.choice(FIRST_NAMES)

def random_book_name():
    return random.choice(BOOK_NAME_FIRST) + random.choice(BOOK_NAME_SECOND)
